Revit 2027 API
Alignment.GetAlignments(View) Method
 Returns all alignments visible in the given view.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<Alignment> GetAlignments(
	View view
)
Public Shared Function GetAlignments (
	view As View
) As ICollection(Of Alignment)
public:
static ICollection<Alignment^>^ GetAlignments(
	View^ view
)
static member GetAlignments :
        view : View -> ICollection<Alignment>
Parameters
view View
The view for which the alignments are returned.
Return Value
ICollection<Alignment>
See Also
Reference
Alignment Class
GetAlignments Overload
Autodesk.Revit.DB.Infrastructure Namespace